/**
  ******************************************************************************
  * @file   
  * @author  
  * @version 
  * @date    
  * @brief   各类公用工具函数
  ******************************************************************************

  ******************************************************************************
  */ 

#include "./Public_Func/tool.h"  
#include <string.h>
#include  <includes.h>


////在str1字符串中找出str2字符串(不包括str2的串结束符,忽略str中的\0)
////返回该位置的指针,如找不到,返回空指针
//uint8_t *my_strstr(const u8 *s1,u16 n1,const u8 *s2,u16 n2)  
//{  
//	int n,x=0,y=0;  
//	if (*s2)	  
//	{
//		while(1)                 
//		{
//			if(*s1==*s2)//找到s2第一次出现，两种情况考虑
//			{
//				for (n=0;n<n2;n++)  
//				{
//					if (*(s1+n)==*(s2+n))
//					{
//						y++;
//						if (y>=n2)
//						//if (!*(s2+n+1))	//s2下一个字符是否为'\0'  
//						{  
//							return (u8 *)s1;  
//						} 
//						if (x+n>=n1-1)	//防止数组越界
//						{  
//							return NULL;  
//						}
//						if (*(s1+n+1)!=*(s2+n+1))//查找的下一个字符不相等,一个字符相等
//						{
//							break;
//						}
//					}
//					else
//					{  
//						break;
//					}
//				}  
//			}
//			s1++;
//			x++;
//			if(x>=n1)
//			{
//				break;
//			}
//		}  
//		return NULL;  
//	}  
//	else  
//	{  
//		return (u8*)s1;  
//	}  
//} 







